IdeaRS.OpenModel.Detail.HangingType
Type of hanging

IdeaRS.OpenModel.Detail.HangingType.StraightAnchorStraightBranches
Straight anchor with straight branches ||

IdeaRS.OpenModel.Detail.HangingType.StraightAnchorLShapedBranches
Straight anchor with L-shaped branches _||_

IdeaRS.OpenModel.Detail.HangingType.AngleAnchorStraightBranches
Angle anchor with straight branches /\

IdeaRS.OpenModel.Detail.HangingType.AngleAnchorLShapedBranches
Angle anchor with L-shaped branches _/\_

IdeaRS.OpenModel.Detail.HangingType.StraightAnchorSingleBar
Straight single bar |